package com.suteam.html.common.util;

/**
 * eyun错误日志枚举
 */
public enum EnumErrorCode {
	/**
	 * 一切正常
	 */
	CODE_000000("000000", "一切正常"),
	/**
	 * 调用接口异常
	 */
	CODE_000001("000001", "调用接口异常"),
	/**
	 * 用户名已存在
	 */
	CODE_000002("000002", "用户名已存在"),
	/**
	 * 用户不存在
	 */
	CODE_000004("000004", "用户不存在"),
	/**
	 * 用户密码错误
	 */
	CODE_000005("000005", "用户密码错误"),
	/**
	 * 用户登录成功
	 */
	CODE_000006("000006", "用户登录成功"),
	/**
	 * 用户未登录
	 */
	CODE_000003("000003", "用户未登录"),
	/**
	 * 用户已登出
	 */
	CODE_000007("000007", "用户已登出"),
	/**
	 * 验证码输入错误
	 */
	CODE_000008("000008", "图形验证码输入错误"),
	/**
	 * 原密码输入错误
	 */
	CODE_000009("000009", "原密码输入错误"),
	/**
	 * 密码修改成功
	 */
	CODE_000010("000010", "密码修改成功"),
	/**
	 * 提交成功	
	 */
	CODE_000011("000011", "提交成功"),
	/**
	 * 提交失败
	 */
	CODE_000012("000012", "提交失败"),
	/**
	 * 	用户未激活
	 */
	CODE_000013("000013", "用户未激活"),
	/**
	 * 用户已禁用
	 */
	CODE_000014("000014", "用户已禁用"),
	/**
	 * 未知的帐户
	 */
	CODE_000015("000015", "未知的帐户"),
	/**
	 * 帐户已被锁定
	 */
	CODE_000016("000016", "帐户已被锁定"),
	/**
	 * 用户名或密码错误次数过多
	 */
	CODE_000017("000017", "用户名或密码错误次数过多"),
	/**
	 * 用户名或密码不正确
	 */
	CODE_000018("000018", "用户名或密码不正确"),
	
	/**
	 * 登录失败
	 */
	CODE_000019("000019", "登录失败"),
	/**
	 * 当前是启用状态
	 */
	CODE_000020("000020", "当前是启用状态"),
	/**
	 * 当前是禁用状态
	 */
	CODE_000021("000021", "当前是禁用状态"),
	
	/**
	 * 用户注册成功
	 */
	CODE_000022("000022", "用户注册成功"),
	/**
	 * 持有人不能为空
	 */
	CODE_000023("000023", "持有人不能为空"),
	/**
	 * 卡号不能为空
	 */
	CODE_000024("000024", "卡号不能为空"),
	/**
	 * 持有人已存在
	 */
	CODE_000025("000025", "持有人已存在"),
	
	/**
	 * cvv2不能为空
	 */
	CODE_000026("000026", "cvv2不能为空"),
	/**
	 * 订单不存在
	 */
	CODE_000027("000027", "订单不存在"),
	/**
	 * 用户不存在
	 */
	CODE_000028("000028", "用户不存在！"),
	/**
	 * 此手机号已经注册，请登录或者重置密码s
	 */
	CODE_000029("000029", "此手机号已经注册，请登录或者重置密码！"),
	/**
	 * 今日的短信次数达到上限
	 */
	CODE_000030("000030", "今日的短信次数达到上限!"),
	/**
	 * 验证码获取失败
	 */
	CODE_000031("000031", "验证码获取失败!"),
	/**
	 * 手机号不存在
	 */
	CODE_000032("000032", "手机号不存在"),
	/**
	 * 手机号已注册！
	 */
	CODE_000033("000033", "手机号已注册！"),
	/**
	 * 注册成功！
	 */
	CODE_000034("000034", "注册成功！"),
	/**
	 * 验证码输入错误
	 */
	CODE_000035("000035", "验证码输入错误"),
	/**
	 * 验证码输入错误
	 */
	CODE_000036("000036", "认证成功！"),
	/**
	 * 验证码输入错误
	 */
	CODE_000037("000037", "认证失败"),
	/**
	 * 跳转成功
	 */
	CODE_000038("000038", "跳转成功"),
	/**
	 * 跳转失败
	 */
	CODE_000039("000039", "跳转失败!"),
	/**
	 * 用户状态禁用
	 */
	CODE_000040("000040", "用户已禁用"),
	/**
	 * 用户认证未通过
	 */
	CODE_000041("000041", "用户认证未通过"),
	/**
	 * 应用未注册
	 */
	CODE_000042("000042", "应用未注册"),
	/**
	 * 应用认证未通过
	 */
	CODE_000043("000043", "应用认证未通过"),
	/**
	 * 删除成功
	 */
	CODE_000044("000044", "删除成功"),
	/**
	 * 删除失败
	 */
	CODE_000045("000045", "删除失败"),
	/**
	 * 删除失败
	 */
	CODE_000046("000046", "邮箱已被绑定"),
	/**
	 * 此手机号已经注册，请更换手机号！
	 */
	CODE_000047("000047", "此手机号已经注册，请更换手机号！"),
	/**
	 *验证码不能为空！
	 */
	CODE_000048("000048", "图形验证码不能为空！"),
	/**
	 *您未绑定手机号，请绑定后再操作
	 */
	CODE_000049("000049", "您未绑定手机号，请绑定后再操作"),
	/**
	 *您未绑定邮箱，请绑定后再操作
	 */
	CODE_000050("000050", "您未绑定邮箱，请绑定后再操作"),
	/**
	 *云服务器状态不为开机状态，无法操作
	 */
	CODE_000051("000051", "云服务器状态不为开机状态，无法操作"),
	/**
	 *发送成功
	 */
	CODE_000052("000052", "发送成功"),
	/**
	 *操作失败
	 */
	CODE_000053("000053", "操作失败"),
	/**
	 *当前有未完成的指令，无法进行操作
	 */
	CODE_000054("000054", "当前有未完成的指令，无法进行操作"),
	/**
	 *当前云服务器已过期，无法操作
	 */
	CODE_000055("000055", "当前云服务器已过期，无法操作"),
	/**
	 *对应数据源不存在
	 */
	CODE_000056("000056", "对应数据源不存在"),
	/**
	 *任务已经开始，无法删除
	 */
	CODE_000057("000057", "任务已经开始，无法删除"),
	/**
	 *模型不存在
	 */
	CODE_000058("000058", "模型不存在"),
	/**
	 *模型分类不存在
	 */
	CODE_000059("000059", "模型分类不存在"),
	/**
	 *模型被占用不能删除
	 */
	CODE_000060("000060", "模型被占用不能删除"),
	/**
	 *对应任务不存在
	 */
	CODE_000061("000061", "对应任务不存在"),
	/**
	 * 表单不可重复提交
	 */
	CODE_000100("000100", "表单不可重复提交"),
	/**
	 * 已超过200个授权用户数，您无法登录！
	 */
	CODE_000101("000101", "已超过200个授权用户数，您无法登录！"),
	/**
	 *服务已到期，请联系管理员！
	 */
	CODE_000102("000102", "服务已到期，请联系管理员！"),
	/**
	 * 路径不存在
	 */
	CODE_000082("000082", "路径不存在"),
	/**
	 *权限已经存在，不能重复添加
	 */
	CODE_000202("000202", "权限已经存在，不能重复添加"),
	/**
	 *角色已经存在，不能重复添加
	 */
	CODE_000203("000203", "角色已经存在，不能重复添加"),
	/**
	 *有用户已经分配该角色，不能删除
	 */
	CODE_000204("000204", "有用户已经分配该角色，不能删除"),
	/**
	 *角色不存在
	 */
	CODE_000205("000205", "角色不存在"),
	/**
	 *系统默认角色不能删除
	 */
	CODE_000206("000206", "系统默认角色不能删除"),
	/**
	 *主菜单没有分配权限，不能添加模块
	 */
	CODE_000207("000207", "主菜单没有分配权限，不能添加模块"),
	/**
	 *该模块已经存在，不能重复添加
	 */
	CODE_000208("000208", "该模块已经存在，不能重复添加"),
	/**
	 *父级菜单下已存在同名菜单，不能重复添加
	 */
	CODE_000209("000209", "父级菜单下已存在同名菜单，不能重复添加"),
	/**
	 *权限已经分配给了其他菜单，不能再次分配
	 */
	CODE_000210("000210", "权限已经分配给了其他菜单，不能再次分配"),
	/**
	 * 请求异常
	 */
	CODE_000400("000400", "请求异常"),
	/**
	 * IP访问受限
	 */
	CODE_000474("000474", "IP访问受限"),
	/**
	 * 用户访问受限
	 */
	CODE_000475("000475", "用户访问受限"),
	/**
	 * SQL注入漏洞
	 */
	CODE_000476("000476", "SQL注入漏洞"),
	/**
	 * token过期
	 */
	CODE_000477("000477", "AccessToken过期"),
	/**
	 * 授权签名认证失败
	 */
	CODE_000478("000478", "授权签名认证失败"),
	/**
	 * Html注入漏洞
	 */
	CODE_000479("000479", "Html注入漏洞"),
	/**
	 * JS注入漏洞
	 */
	CODE_000480("000480", "JS注入漏洞"),
	/**
	 * 服务器异常
	 */
	CODE_000500("000500", "服务器异常"),
	/**
	 * 服务器超时
	 */
	CODE_000503("000503", "服务器超时"),
	
	/**
	 * 传入参数异常
	 */
	CODE_000504("000504", "传入参数异常"),
	/**
	 * 云服务器不存在
	 */
	CODE_000505("000505", "云服务器不存在"),
	/**
	 * 云服务器操作日志不存在
	 */
	CODE_000506("000506", "云服务器操作日志不存在"),
	/**
	 * 云服务器操作日志不存在
	 */
	CODE_000507("000507", "该虚拟机已存在"),
	CODE_000508("000508", "操作失败"),
	/**
	 * 开放服务信息不存在
	 */
	CODE_000509("000509", "开放服务信息不存在"),
	/**
	 * 我的开放服务所对应的订单信息不存在
	 */
	CODE_000510("000510", "我的开放服务所对应的订单信息不存在"),
	CODE_000511("000511", "状态相同"),
	/**
	 * 云服务器已到期或过期
	 */
	CODE_000512("000512", "云服务器已到期或过期");
	
	
	public String code;
	public String msg;

	EnumErrorCode(String code, String msg) {
		this.code = code;
		this.msg = msg;
	}
}
